In [1]:
import pandas as pd

# Concat

## Новые данные

In [38]:
a = pd.DataFrame(data={'a': [1,2,3,4], 'b': [5,6,7,8], 'c': [9, 10, 11, 12]})
a

   a  b   c
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [39]:
new_data = pd.DataFrame(data={'a': [0], 'b': [0], 'c': [0]})
new_data

   a  b  c
0  0  0  0

<div class="panel panel-warning" style="margin: 50px 0 0 0">
    <div class="panel-heading">
        <h3 class="panel-title">Обратите внимание</h3> 
    </div>
</div>

Индекс сохраняется, если не выставить флажок __ignore_index__:

In [9]:
pd.concat([a, new_data])

   a  b   c
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12
0  0  0   0

In [4]:
pd.concat([a, new_data], ignore_index=True)

   a  b   c
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12
4  0  0   0

## Новые столбцы

In [5]:
d = pd.DataFrame(data={'d': [13,14,15,16]})
d

    d
0  13
1  14
2  15
3  16

In [7]:
pd.concat([a, d], axis=1)

   a  b   c   d
0  1  5   9  13
1  2  6  10  14
2  3  7  11  15
3  4  8  12  16

<div class="panel panel-warning" style="margin: 50px 0 0 0">
    <div class="panel-heading">
        <h3 class="panel-title">Обратите внимание</h3> 
    </div>
</div>

Будьте внимательны с индексами:

In [8]:
d = pd.DataFrame(data={'d': [13,14,15,16]}, index=[2,3,4,5])
d

    d
2  13
3  14
4  15
5  16

In [9]:
pd.concat([a,d], axis=1)

     a    b     c     d
0  1.0  5.0   9.0   NaN
1  2.0  6.0  10.0   NaN
2  3.0  7.0  11.0  13.0
3  4.0  8.0  12.0  14.0
4  NaN  NaN   NaN  15.0
5  NaN  NaN   NaN  16.0

In [10]:
pd.concat([a,d], axis=1, ignore_index=True) # <трагическая музыка> пам-пам-пааааам </трагическая музыка>

     0    1     2     3
0  1.0  5.0   9.0   NaN
1  2.0  6.0  10.0   NaN
2  3.0  7.0  11.0  13.0
3  4.0  8.0  12.0  14.0
4  NaN  NaN   NaN  15.0
5  NaN  NaN   NaN  16.0

In [15]:
pd.concat([a, d.reset_index(drop=True)], axis=1)

   a  b   c   d
0  1  5   9  13
1  2  6  10  14
2  3  7  11  15
3  4  8  12  16

# Merge

Хорошие новости: абсолютно все законы __join__'ов из _SQL_ работают и в _pandas_, только называются немного по-другому.

<img src="images/sql_joins.png" width="50%">

### Все виды merge'ей

In [16]:
a = pd.DataFrame(data={'id': [1,2,3], 'a_data': [100, 200, 300]}, index=[1,4,7])
b = pd.DataFrame(data={'id': [2,3,4], 'b_data': [200, 300, 400]}, index=[2,5,7])
a

   a_data  id
1     100   1
4     200   2
7     300   3

In [17]:
b

   b_data  id
2     200   2
5     300   3
7     400   4

In [18]:
pd.merge(a,b) # inner по-умолчанию

   a_data  id  b_data
0     200   2     200
1     300   3     300

In [20]:
pd.merge(a,b, how='left')

   a_data  id  b_data
0     100   1     NaN
1     200   2   200.0
2     300   3   300.0

In [21]:
pd.merge(a,b, how='right')

   a_data  id  b_data
0   200.0   2     200
1   300.0   3     300
2     NaN   4     400

In [22]:
pd.merge(a,b, how='outer')

   a_data  id  b_data
0   100.0   1     NaN
1   200.0   2   200.0
2   300.0   3   300.0
3     NaN   4   400.0

### on

In [23]:
a = pd.DataFrame(data={'name': ['John','Steve','Mary'], 'town': ['LA', 'SF', 'NY'], 'a_data': [100, 200, 300]})
b = pd.DataFrame(data={'name': ['John','Steve','Mary'], 'town': ['WT', 'SF', 'OH'], 'b_data': [200, 300, 400]})
a

   a_data   name town
0     100   John   LA
1     200  Steve   SF
2     300   Mary   NY

In [24]:
b

   b_data   name town
0     200   John   WT
1     300  Steve   SF
2     400   Mary   OH

In [25]:
pd.merge(a,b)

   a_data   name town  b_data
0     200  Steve   SF     300

In [26]:
pd.merge(a,b, on=['name'])

   a_data   name town_x  b_data town_y
0     100   John     LA     200     WT
1     200  Steve     SF     300     SF
2     300   Mary     NY     400     OH

### left_on, right_on

In [27]:
a = pd.DataFrame(data={'Имя': ['John','Steve','Mary'], 'Город': ['LA', 'SF', 'NY'], 'Число': [100, 200, 300]})
b = pd.DataFrame(data={'name': ['John','Mary','Steve'], 'town': ['WT', 'OH', 'SF'], 'b_data': [200, 300, 400]})
a

  Город    Имя  Число
0    LA   John    100
1    SF  Steve    200
2    NY   Mary    300

In [28]:
b

   b_data   name town
0     200   John   WT
1     300   Mary   OH
2     400  Steve   SF

In [29]:
pd.merge(a,b, left_on=['Имя'], right_on=['name'])

  Город    Имя  Число  b_data   name town
0    LA   John    100     200   John   WT
1    SF  Steve    200     400  Steve   SF
2    NY   Mary    300     300   Mary   OH